class Script:
    """
    Class to hold all text messages for the bot.
    """

    START_TEXT = (
"""
**𝒲𝑒𝓁𝒸𝑜𝓂𝑒 𝓉𝑜 𝒫𝓇𝒾𝒸𝑒 𝒯𝓇𝒶𝒸𝓀𝑒𝓇 𝐵𝑜𝓉!**

ᴇᴀꜱɪʟʏ ᴛʀᴀᴄᴋ ᴘʀɪᴄᴇꜱ ᴏꜰ ʏᴏᴜʀ ꜰᴀᴠᴏʀɪᴛᴇ ᴘʀᴏᴅᴜᴄᴛꜱ ꜰʀᴏᴍ ᴀᴍᴀᴢᴏɴ 🛒 ᴀɴᴅ ꜰʟɪᴘᴋᴀʀᴛ 📦.

**--🔍 ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴍᴇ ᴀ ᴘʀᴏᴅᴜᴄᴛ ʟɪɴᴋ, ᴀɴᴅ ɪ’ʟʟ:--**

📉 ᴛʀᴀᴄᴋ ᴘʀɪᴄᴇ ᴄʜᴀɴɢᴇꜱ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ
🔔 ɴᴏᴛɪꜰʏ ʏᴏᴜ ᴡʜᴇɴ ᴛʜᴇ ᴘʀɪᴄᴇ ᴅʀᴏᴘꜱ
📊 ꜱʜᴏᴡ ᴘʀᴏᴅᴜᴄᴛ ᴅᴇᴛᴀɪʟꜱ & ᴄᴜʀʀᴇɴᴛ ᴘʀɪᴄᴇ
✨ ꜱᴛᴀʏ ᴀʜᴇᴀᴅ ᴏꜰ ᴅᴇᴀʟꜱ ᴀɴᴅ ɴᴇᴠᴇʀ ᴍɪꜱꜱ ᴀ ᴅɪꜱᴄᴏᴜɴᴛ!
"""
    )

    HELP_TEXT = (
        """
**--ℹ️ 𝙷𝚘𝚠 𝚝𝚘 𝚄𝚜𝚎 𝙿𝚛𝚒𝚌𝚎 𝚃𝚛𝚊𝚌𝚔𝚎𝚛 𝙱𝚘𝚝⁉️--**

**--1️⃣ ꜱᴛᴀʀᴛ ᴛʀᴀᴄᴋɪɴɢ--**

**​🇸​​🇪​​🇳​​🇩​ ​🇲​​🇪​ ​🇦​​🇳​​🇾​ ​🇦​​🇲​​🇦​​🇿​​🇴​​🇳​ 🛒 ​🇴​​🇷​ ​🇫​​🇱​​🇮​​🇵​​🇰​​🇦​​🇷​​🇹​ 📦 ​🇵​​🇷​​🇴​​🇩​​🇺​​🇨​​🇹​ ​🇱​​🇮​​🇳​​🇰​.
🇨​​🇱​​🇮​​🇨​​🇰​ ​🇴​​🇳​ ​🇸​​🇹​​🇦​​🇷​​🇹​ ​🇹​​🇷​​🇦​​🇨​​🇰​​🇮​​🇳​​🇬​ ​🇹​​🇴​ ​🇧​​🇪​​🇬​​🇮​​🇳​ ​🇹​​🇷​​🇦​​🇨​​🇰​​🇮​​🇳​​🇬​ ​🇹​​🇭​​🇪​ ​🇵​​🇷​​🇴​​🇩​​🇺​​🇨​​🇹​’​🇸​ ​🇵​​🇷​​🇮​​🇨​​🇪​.**

**--2️⃣ ᴠɪᴇᴡ ʏᴏᴜʀ ᴛʀᴀᴄᴋɪɴɢꜱ--**

**ᴜꜱᴇ /my_trackings ᴛᴏ ꜱᴇᴇ ᴀʟʟ ᴛʜᴇ ᴘʀᴏᴅᴜᴄᴛꜱ ʏᴏᴜ’ʀᴇ ᴄᴜʀʀᴇɴᴛʟʏ ᴛʀᴀᴄᴋɪɴɢ.**

**--3️⃣ ʀᴇᴍᴏᴠᴇ ᴛʀᴀᴄᴋɪɴɢ--**

**ꜰʀᴏᴍ ʏᴏᴜʀ ᴛʀᴀᴄᴋɪɴɢꜱ ʟɪꜱᴛ, ʏᴏᴜ ᴄᴀɴ ʀᴇᴍᴏᴠᴇ ᴘʀᴏᴅᴜᴄᴛꜱ ʏᴏᴜ ɴᴏ ʟᴏɴɢᴇʀ ᴡᴀɴᴛ ᴛᴏ ᴛʀᴀᴄᴋ.**

**--📢 ꜱᴜᴘᴘᴏʀᴛ & ɪꜱꜱᴜᴇꜱ--**

ꜱᴛᴀʏ ᴜᴘᴅᴀᴛᴇᴅ, ꜱᴀᴠᴇ ᴍᴏɴᴇʏ 💰, ᴀɴᴅ ɴᴇᴠᴇʀ ᴍɪꜱꜱ ᴀ ᴅᴇᴀʟ! 🚀
𝒮𝓉𝒶𝓎 𝓊𝓅𝒹𝒶𝓉𝑒𝒹, 𝓈𝒶𝓋𝑒 𝓂𝑜𝓃𝑒𝓎 💰, 𝒶𝓃𝒹 𝓃𝑒𝓋𝑒𝓇 𝓂𝒾𝓈𝓈 𝒶 𝒹𝑒𝒶𝓁! 🚀
"""
    )

    ABOUT_TEXT = (
        "**ℹ️ About Me**\n\n"
        "🤖 **Name:** My Bot\n"
        "👨‍💻 **Dev:** [Developer](https://t.me/YourUsername)\n"
        "🐍 **Language:** Python 3\n"
        "🔥 **Library:** Pyrogram"
    )

    STATS_TEXT = (
        "🍀 **Bot Statistics** 🍀\n\n"
        "🙋‍♂️ **Total Users:** `{}`"
    )
  
